# Groupby

In [9]:
import pandas as pd
import numpy as np

In [21]:
data = {
    'Company': ['GOOG','GOOG', 'FB', 'FB', 'MS', 'MS'],
    'person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'sales' : [200, 3300, 1000, 123, 5, 6]
}

In [22]:
df = pd.DataFrame(data)

In [14]:
df

  Company   person  sales
0    GOOG      Sam    200
1    GOOG  Charlie   3300
2      FB      Amy      7
3      FB  Vanessa    123
4      MS     Carl      5
5      MS    Sarah      6

In [16]:
df.groupby('Company')

In [17]:
by_comp = df.groupby('Company')

In [19]:
by_comp.mean() # Gets mean of each dataframe, only numeric elements

          sales
Company
FB         65.0
GOOG     1750.0
MS          5.5

In [23]:
by_comp.min()

          person  sales
Company
FB           Amy      7
GOOG     Charlie    200
MS          Carl      5

In [24]:
by_comp.std()

               sales
Company
FB         82.024387
GOOG     2192.031022
MS          0.707107

In [25]:
by_comp.count()

         person  sales
Company
FB            2      2
GOOG          2      2
MS            2      2

In [26]:
by_comp.describe()

        sales
        count    mean          std    min     25%     50%      75%     max
Company
FB        2.0    65.0    82.024387    7.0   36.00    65.0    94.00   123.0
GOOG      2.0  1750.0  2192.031022  200.0  975.00  1750.0  2525.00  3300.0
MS        2.0     5.5     0.707107    5.0    5.25     5.5     5.75     6.0

In [28]:
by_comp.describe().T

Company              FB         GOOG        MS
sales count    2.000000     2.000000  2.000000
      mean    65.000000  1750.000000  5.500000
      std     82.024387  2192.031022  0.707107
      min      7.000000   200.000000  5.000000
      25%     36.000000   975.000000  5.250000
      50%     65.000000  1750.000000  5.500000
      75%     94.000000  2525.000000  5.750000
      max    123.000000  3300.000000  6.000000